from sklearn.naive_bayes import GaussianNB   #import Gaussian Bayes modeling function
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

In [1]:
import pandas as pd

In [2]:
assessments_loc = "../datasets/assessments.csv"
assessments = pd.read_csv(assessments_loc)

courses_loc = "../datasets/courses.csv"
courses = pd.read_csv(courses_loc)

student_assess_loc = "../datasets/studentAssessment.csv"
student_assess = pd.read_csv(student_assess_loc)

student_info_loc = "../datasets/studentInfo.csv"
student_info = pd.read_csv(student_info_loc)


student_reg_loc = "../datasets/studentRegistration.csv"
student_reg = pd.read_csv(student_reg_loc)

student_vle_loc = "../datasets/studentVle.csv"
student_vle = pd.read_csv(student_vle_loc)

vle_loc = "../datasets/vle.csv"
vle = pd.read_csv(vle_loc)

In [3]:
print(assessments.shape)
assessments.head()

(206, 6)

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [4]:
assessments.dtypes

code_module           object
code_presentation     object
id_assessment          int64
assessment_type       object
date                 float64
weight               float64
dtype: object

In [5]:
assessments.count()

code_module          206
code_presentation    206
id_assessment        206
assessment_type      206
date                 195
weight               206
dtype: int64

In [6]:
print(courses.shape)
courses.head()

(22, 3)

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

In [7]:
courses.dtypes

code_module                   object
code_presentation             object
module_presentation_length     int64
dtype: object

In [8]:
courses.count()

code_module                   22
code_presentation             22
module_presentation_length    22
dtype: int64

In [9]:
print(student_assess.shape)
student_assess.head()

(173912, 5)

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

In [10]:
student_assess.dtypes

id_assessment       int64
id_student          int64
date_submitted      int64
is_banked           int64
score             float64
dtype: object

In [11]:
student_assess.count()

id_assessment     173912
id_student        173912
date_submitted    173912
is_banked         173912
score             173739
dtype: int64

In [12]:
print(student_info.shape)
student_info.head()

(32593, 12)

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass

In [13]:
student_info.dtypes

code_module             object
code_presentation       object
id_student               int64
gender                  object
region                  object
highest_education       object
imd_band                object
age_band                object
num_of_prev_attempts     int64
studied_credits          int64
disability              object
final_result            object
dtype: object

In [14]:
student_info.count()

code_module             32593
code_presentation       32593
id_student              32593
gender                  32593
region                  32593
highest_education       32593
imd_band                31482
age_band                32593
num_of_prev_attempts    32593
studied_credits         32593
disability              32593
final_result            32593
dtype: int64

In [15]:
print(student_reg.shape)
student_reg.head()

(32593, 5)

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [16]:
student_reg.dtypes

code_module             object
code_presentation       object
id_student               int64
date_registration      float64
date_unregistration    float64
dtype: object

In [17]:
print(student_vle.shape)
student_vle.head()

(10655280, 6)

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

In [18]:
student_vle.count()

code_module          10655280
code_presentation    10655280
id_student           10655280
id_site              10655280
date                 10655280
sum_click            10655280
dtype: int64

In [19]:
student_vle.dtypes

code_module          object
code_presentation    object
id_student            int64
id_site               int64
date                  int64
sum_click             int64
dtype: object

In [20]:
print(vle.shape)
vle.head()

(6364, 6)

   id_site code_module code_presentation activity_type  week_from  week_to
0   546943         AAA             2013J      resource        NaN      NaN
1   546712         AAA             2013J     oucontent        NaN      NaN
2   546998         AAA             2013J      resource        NaN      NaN
3   546888         AAA             2013J           url        NaN      NaN
4   547035         AAA             2013J      resource        NaN      NaN

In [21]:
vle.dtypes

id_site                int64
code_module           object
code_presentation     object
activity_type         object
week_from            float64
week_to              float64
dtype: object

In [22]:
vle.count()

id_site              6364
code_module          6364
code_presentation    6364
activity_type        6364
week_from            1121
week_to              1121
dtype: int64

In [23]:
df_student2 = pd.merge(student_info, student_assess, on = "id_student")

In [24]:
df_student2.head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,id_assessment,date_submitted,is_banked,score
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,1752,18,0,78.0
1,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,1753,53,0,85.0
2,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,1754,115,0,80.0
3,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,1755,164,0,85.0
4,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,1756,212,0,82.0

In [25]:
student_reg = student_reg.drop(['code_module','code_presentation'], axis=1)
student_vle = student_vle.drop(['date'],axis=1)

In [26]:
df_student = pd.merge(student_vle, student_reg, on="id_student")

In [27]:
df_student.head()

,code_module,code_presentation,id_student,id_site,sum_click,date_registration,date_unregistration
0,AAA,2013J,28400,546652,4,-53.0,NaN
1,AAA,2013J,28400,546652,1,-53.0,NaN
2,AAA,2013J,28400,546652,1,-53.0,NaN
3,AAA,2013J,28400,546614,11,-53.0,NaN
4,AAA,2013J,28400,546714,1,-53.0,NaN

In [28]:
vle = vle.drop(['code_module','code_presentation'], axis=1)

In [29]:
df_student3 = pd.merge(df_student, vle, on="id_site")

In [30]:
df_student3.head()

,code_module,code_presentation,id_student,id_site,sum_click,date_registration,date_unregistration,activity_type,week_from,week_to
0,AAA,2013J,28400,546652,4,-53.0,NaN,forumng,NaN,NaN
1,AAA,2013J,28400,546652,1,-53.0,NaN,forumng,NaN,NaN
2,AAA,2013J,28400,546652,1,-53.0,NaN,forumng,NaN,NaN
3,AAA,2013J,28400,546652,8,-53.0,NaN,forumng,NaN,NaN
4,AAA,2013J,28400,546652,3,-53.0,NaN,forumng,NaN,NaN

In [31]:
assessments = assessments.drop(['code_module','code_presentation'], axis=1)

In [32]:
pd.set_option('display.max_columns', None)  
pd.set_option('display.expand_frame_repr', False)
pd.set_option('max_colwidth', -1)

In [33]:
df_student4 = pd.merge(df_student2, assessments, on = "id_assessment")

In [34]:
df_student4.head()

  code_module code_presentation  id_student gender                region      highest_education imd_band age_band  num_of_prev_attempts  studied_credits disability final_result  id_assessment  date_submitted  is_banked  score assessment_type  date  weight
0  AAA         2013J             11391       M      East Anglian Region   HE Qualification       90-100%  55<=     0                     240              N          Pass         1752           18              0          78.0   TMA             19.0  10.0
1  AAA         2013J             28400       F      Scotland              HE Qualification       20-30%   35-55    0                     60               N          Pass         1752           22              0          70.0   TMA             19.0  10.0
2  AAA         2013J             31604       F      South East Region     A Level or Equivalent  50-60%   35-55    0                     60               N          Pass         1752           17              0          72.0   TMA             19.0  10.0
3  AAA         2013J             32885       F      West Midlands Region  Lower Than A Level     50-60%   0-35     0                     60               N          Pass         1752           26              0          69.0   TMA             19.0  10.0
4  AAA         2013J             38053       M      Wales                 A Level or Equivalent  80-90%   35-55    0                     60               N          Pass         1752           19              0          79.0   TMA             19.0  10.0

In [35]:
df_student4.columns.values

array(['code_module', 'code_presentation', 'id_student', 'gender',
       'region', 'highest_education', 'imd_band', 'age_band',
       'num_of_prev_attempts', 'studied_credits', 'disability',
       'final_result', 'id_assessment', 'date_submitted', 'is_banked',
       'score', 'assessment_type', 'date', 'weight'], dtype=object)

In [36]:
df_student3 = df_student3.drop(['code_module','code_presentation'],axis=1)
df_student3.columns.values

array(['id_student', 'id_site', 'sum_click', 'date_registration',
       'date_unregistration', 'activity_type', 'week_from', 'week_to'],
      dtype=object)

In [37]:
df_Final = pd.merge(df_student4, df_student3, on="id_student")

In [38]:
df_Final.head()

  code_module code_presentation  id_student gender               region highest_education imd_band age_band  num_of_prev_attempts  studied_credits disability final_result  id_assessment  date_submitted  is_banked  score assessment_type  date  weight  id_site  sum_click  date_registration  date_unregistration activity_type  week_from  week_to
0  AAA         2013J             11391       M      East Anglian Region  HE Qualification  90-100%  55<=     0                     240              N          Pass         1752           18              0          78.0   TMA             19.0  10.0    546652   1         -159.0             NaN                   forumng      NaN        NaN
1  AAA         2013J             11391       M      East Anglian Region  HE Qualification  90-100%  55<=     0                     240              N          Pass         1752           18              0          78.0   TMA             19.0  10.0    546652   1         -159.0             NaN                   forumng      NaN        NaN
2  AAA         2013J             11391       M      East Anglian Region  HE Qualification  90-100%  55<=     0                     240              N          Pass         1752           18              0          78.0   TMA             19.0  10.0    546652   5         -159.0             NaN                   forumng      NaN        NaN
3  AAA         2013J             11391       M      East Anglian Region  HE Qualification  90-100%  55<=     0                     240              N          Pass         1752           18              0          78.0   TMA             19.0  10.0    546652   7         -159.0             NaN                   forumng      NaN        NaN
4  AAA         2013J             11391       M      East Anglian Region  HE Qualification  90-100%  55<=     0                     240              N          Pass         1752           18              0          78.0   TMA             19.0  10.0    546652   6         -159.0             NaN                   forumng      NaN        NaN

In [39]:
df_Final.dtypes

code_module             object
code_presentation       object
id_student              int64
gender                  object
region                  object
highest_education       object
imd_band                object
age_band                object
num_of_prev_attempts    int64
studied_credits         int64
disability              object
final_result            object
id_assessment           int64
date_submitted          int64
is_banked               int64
score                   float64
assessment_type         object
date                    float64
weight                  float64
id_site                 int64
sum_click               int64
date_registration       float64
date_unregistration     float64
activity_type           object
week_from               float64
week_to                 float64
dtype: object

In [40]:
#total missing values
df_Final.isnull().sum()

MemoryError:

In [ ]:
#only dataframe with non-null year column values
df_Final = df_Final.loc[df_Final['Date'].notnull()]

#change year column into a string
#need to use string type for getYear function below
df_Final['Date'] = df_Final['Date'].astype(str)